moved all PlantUML diagrams to Mermaid
