--- a/content/posts/2021-07-03-10:25-kotlin-decorator-pattern.md
+++ b/content/posts/2021-07-03-10:25-kotlin-decorator-pattern.md
@@ -29,29 +30,28 @@ The decorator's job is to "wrap" (hence another name: "Wrapper") the original ob
 There are few key pieces in the `Decorator` pattern:
 
-{% plantuml %}
-@startuml
-skinparam linetype ortho
-hide members
-show Decorator members
+```mermaid
+classDiagram
+    class Client
+    interface Component
+    class ConcreteComponent
+    class Decorator {
+         << abstract >>
+        #Component component
+    }
+    class ConcreteDecorator
 
-class Client
-interface Component
-class ConcreteComponent implements Component
-abstract class Decorator implements Component{
-# component: Component
-}
-class ConcreteDecorator extends Decorator
+    Client -- Component: using
+    Decorator o-- Component
+    Decorator ..|> Component
+    ConcreteDecorator --|> Decorator
+    ConcreteComponent ..|> Component
 
-Client -right- Component : using
-
-Decorator o-- Component
-
-@enduml
-{% endplantuml %}
+```
 
 Elements:
 
@@ -301,58 +319,62 @@ val tcpJsonBase64Comm: Comm = Base46Decorator( // encode just the message with B
+  The deeper the decorator is, the later it will be called with the result of processing data from earlier decorators.
 
-{% plantuml %}
-@startuml
+```mermaid
+sequenceDiagram
+    Client ->> JsonDecorator: sendMessage("hello")
+    JsonDecorator ->> Base46Decorator: sendMessage({"message": "hello"})
+    Base46Decorator ->> TcpComm: sendMessage("eyJtZXNzYWdlIjoiaGVsbG8ifQ==")
+    TcpComm ->> TcpModule: send(body: "eyJtZXNzYW...")
+    TcpModule ->> TcpComm: Success/Fail
+    TcpComm ->> Base46Decorator: Success/Fail
+    Base46Decorator ->> JsonDecorator: Success/Fail
+    JsonDecorator ->> Client: Success/Fail
 
-Client -> JsonDecorator : sendMessage("hello")
-JsonDecorator -> Base46Decorator : sendMessage({"message": "hello"})
-Base46Decorator -> TcpComm : sendMessage("eyJtZXNzYWdlIjoiaGVsbG8ifQ==")
-TcpComm -> TcpModule : send(body: "eyJtZXNzYW...)
-TcpModule -> TcpComm : Success/Fail
-TcpComm -> Base46Decorator : Success/Fail
-Base46Decorator -> JsonDecorator : Success/Fail
-JsonDecorator -> Client : Success/Fail
+```
 
-@enduml
-{% endplantuml %}
+As I wrote earlier, one of the decorators could also throw an exception or not use the method from the decorated object at all and return a constant. This can be helpful, for example, when we want to obscure some data depending on where we send it. For example, application logs using the class
 
