--- a/content/posts/2021-07-17-16:23-kotlin-mediator-pattern.md
+++ b/content/posts/2021-07-17-16:23-kotlin-mediator-pattern.md
@@ -31,50 +33,55 @@ For this reason, the `Mediator` pattern seems to me **to fit rather for refactor
 - **Component** - doesn't know other components, doesn't depend on them (though it may depend on other classes). It communicates only with the `Mediator` who is calling appropriate`components`
 
-{% plantuml %}
-@startuml
+```mermaid
+classDiagram
+    class Mediator {
+         << interface >>
+        + notify(sender, event, context)
+    }
 
-interface Mediator{
-	+ notify(sender, event, context)
-}
-class ConcreteMediator implements Mediator{
-	- componentA: ComponentA
-	- componentB: ComponentB
-	- componentC: ComponentC
-	+ notify(sender, event, context)
-}
+    class ConcreteMediator {
+        - componentA: ComponentA
+        - componentB: ComponentB
+        - componentC: ComponentC
+        + notify(sender, event, context)
+    }
 
-class ComponentA{
-	- mediator: Mediator
-}
-class ComponentB{
-	- mediator: Mediator
-}
-class ComponentC{
-	- mediator: Mediator
-}
+    class ComponentA {
+        - mediator: Mediator
+    }
+    class ComponentB {
+        - mediator: Mediator
+    }
+    class ComponentC {
+        - mediator: Mediator
+    }
 
-ComponentA --* ConcreteMediator::componentA
-ComponentB --* ConcreteMediator::componentB
-ComponentC --* ConcreteMediator::componentC
+    ConcreteMediator ..|> Mediator
 
-ComponentA::mediator-left->ConcreteMediator::notify
-ComponentB::mediator-right->ConcreteMediator::notify
-ComponentC::mediator-up->ConcreteMediator::notify
+    ComponentA --* ConcreteMediator
+    ComponentB --* ConcreteMediator
+    ComponentC --* ConcreteMediator
 
-@enduml
-{% endplantuml %}
+    ComponentA --> ConcreteMediator:notify
+    ComponentB --> ConcreteMediator:notify
+    ComponentC --> ConcreteMediator:notify
+```
 
 It is worth noting that the only interface needed is `Mediator`, which all the` components` know. Each `component` is a separate and independent object that probably already inherits from another class or implements the needed interfaces. You may be tempted to introduce an additional `Component` interface, but it would not do much, because the `Mediator` needs to know the specific interfaces of its `components` to be able to call specific methods after receiving the message.
 
