--- a/content/posts/2021-02-26-kotlin-factory-method-pattern.md
+++ b/content/posts/2021-02-26-kotlin-factory-method-pattern.md
@@ -127,44 +127,47 @@ val circle: Figure = figureFactory.createFigure(FigureFactory.Type.Circle)
 ```
 
-{% plantuml %}
-@startuml
-interface Figure{
-+createManipulator(): FigureManipulator
-}
-interface FigureManipulator {
-+drag()
-+resize(scale: Float)
-}
+```mermaid
+classDiagram
+    class Client
 
-class Client
+    class Figure {
+        << interface >>
+        +FigureManipulator createManipulator()
+    }
+    class FigureManipulator {
+        << interface >>
+        +drag()
+        +resize(Float scale)
+    }
 
-Client -left-> Figure
-Client -right-> FigureManipulator
+    class Circle {
+        +FigureManipulator createManipulator()
+    }
+    class Square {
+        +FigureManipulator createManipulator()
+    }
 
-class Circle extends Figure {
-+createManipulator(): FigureManipulator
-}
-class Square extends Figure {
-+createManipulator(): FigureManipulator
-}
+    class CircleManipulator {
+        -Circle figure
+        +drag()
+        +resize(Float scale)
+    }
+    class SquareManipulator {
+        -Square figure
+        +drag()
+        +resize(Float scale)
+    }
+    Circle --|> Figure
+    Square --|> Figure
+    Client .. Figure
+    Client .. FigureManipulator
+    CircleManipulator --|> FigureManipulator
+    SquareManipulator --|> FigureManipulator
+    Circle ..> CircleManipulator
+    Square ..> SquareManipulator
 
-class CircleManipulator extends FigureManipulator {
--figure:Circle
-+drag()
-+resize(scale: Float)
-}
-
-class SquareManipulator extends FigureManipulator {
--figure:Square
-+drag()
-+resize(scale: Float)
-}
-
-Circle::createManipulator .right.> CircleManipulator
-Square::createManipulator .right.> SquareManipulator
-@enduml
-{% endplantuml %}
+```
 
 ### Elements
 
@@ -321,59 +338,64 @@ val db: Database = DatabaseFactory.getDatabaseForConfig(mySqlConfig)
 ```
 
-{% plantuml %}
-@startuml
-scale 900 width
+```mermaid
+classDiagram
+    class Database {
+        << interface >>
+        +save(Any item)
+        +getItem(Int id)
+    }
 
-interface Database {
-+save(item: Any)
-+getItem(id: Int)
-}
+    class DatabaseConfig {
+        << sealed class >>
+    }
 
-class DatabaseConfig << (S,orchid) Sealed Class >>{
+    class MySqlConfig {
+        -address
+        -port
+    }
+    class RealmConfig {
+        -dbName
+    }
+    class MongoDBConfig {
+        -fileUri
+        -tableName
+    }
 
-}
+    class MySql {
+        -config: MySqlConfig
+        +save(Any item)
+        +getItem(Int id)
+    }
+    class Realm {
+        -RealmConfig config
+        +save(Any item)
+        +getItem(Int id)
+    }
+    class MongoDB {
+        -MongoDBConfig config
+        +save(Any item)
+        +getItem(Int id)
+    }
 
-class MySqlConfig extends DatabaseConfig{
--address
--port
-}
-class RealmConfig extends DatabaseConfig{
--dbName
-}
-class MongoDBConfig extends DatabaseConfig{
--fileUri
--tableName
-}
+    class Factory {
+        +Database getDatabaseForConfig(DatabaseConfig config)
+    }
 
-class MySql implements Database{
--config:MySqlConfig
-+save(item: Any)
-+getItem(id: Int)
-}
-class Realm implements Database{
--config:RealmConfig
-+save(item: Any)
-+getItem(id: Int)
-}
-class MongoDB implements Database{
--config:MongoDBConfig
-+save(item: Any)
-+getItem(id: Int)
-}
+    class BadConfig
 
-class Factory{
-+getDatabaseForConfig(config: DatabaseConfig): Database
-}
+    MySql ..|> Database
+    Realm ..|> Database
+    MongoDB ..|> Database
 
-class BadConfig extends MongoDBConfig
+    Factory --> Database
+    Factory <-- DatabaseConfig
 
-Factory::getDatabaseForConfig-[bold]->Database
-Factory::getDatabaseForConfig<-[bold]-DatabaseConfig
-DatabaseConfig-[hidden]->Database
-
-@enduml
-{% endplantuml %}
+    MySqlConfig --|> DatabaseConfig
+    RealmConfig --|> DatabaseConfig
+    MongoDBConfig --|> DatabaseConfig
+    BadConfig --|> MongoDBConfig
+```
 
 ```kotlin
 // common interface available for clients
@@ -462,50 +484,58 @@ repeat(10) {
 On diagram it will look like that:
 
-{% plantuml %}
-@startuml
-scale 900 width
+```mermaid
+classDiagram
+    class Part {
+        << interface >>
+    }
 
-interface Part
+    class PartFactory {
+        << interface >>
+        +T create()
+    }
 
-interface PartFactory<T: Part>{
-+create():T
-}
+    class AirFilter {
+        -constructor()
+        +companion object
+    }
+    class AirFilterFactory {
+        +AirFilter create()
+    }
 
-class AirFilter implements Part{
--constructor()
-+companion object
-}
+    class FuelFilter {
+        +companion object
+    }
+    class FuelFilterFactory {
+        +FuelFilter create()
+    }
 
-class AirFilterFactory<AirFilter><< (O,#FF7700) CompanionObject >> implements PartFactory{
-+create():AirFilter
-}
+    class Engine
 
-class FuelFilter implements Part{
-+companion object
-}
-class FuelFilterFactory<FuelFilter><< (O,#FF7700) CompanionObject >> implements PartFactory{
-+create():FuelFilter
-}
+    class EngineFactory
 
-class Engine implements Part
+    class RandomPartCreator {
+        -Set partFactories
+        +registerFactory(PartFactory factory)
+        +Part createRandomPart()
+    }
 
-class EngineFactory<Engine> implements PartFactory
 
-class RandomPartCreator{
--partFactories: Set<PartFactory>
-+registerFactory(factory: PartFactory)
-+createRandomPart(): Part
-}
+    Engine ..|> Part
+    AirFilter ..|> Part
+    FuelFilter ..|> Part
 
-RandomPartCreator::createRandomPart-[bold]->Part
-RandomPartCreator::registerFactory<-[bold]-PartFactory
-Part-[hidden]->PartFactory
+    RandomPartCreator --> Part
+    RandomPartCreator <-- PartFactory
 
-@enduml
-{% endplantuml %}
+    EngineFactory ..|> PartFactory
+    AirFilterFactory ..|> PartFactory
+    FuelFilterFactory ..|> PartFactory
+
+```
 
 And can be implemented like this:
 
