--- a/content/posts/2021-06-26-kotlin-adapter-pattern.md
+++ b/content/posts/2021-06-26-kotlin-adapter-pattern.md
@@ -28,31 +30,36 @@ The adapter allows you to "map" an adapted interface (`Adaptee`) to the expected
 The `adapter` is essentially a single class, but it's important to understand its surroundings.
 
-{% plantuml %}
-@startuml
-skinparam groupComposition 1
-class Client{
-- useTarget()
-}
-interface Target{
-+ method()
-}
-class Adapter extends Target{
-+ method()
-- adaptee: Adaptee
-}
-interface Adaptee{
- + otherMethod() 
-}
+```mermaid
+classDiagram
+    class Client {
+        - useTarget()
+    }
 
-Adapter::adaptee -right-* Adaptee
-Client-right->Target
-Adapter::method..>Adaptee::otherMethod
+    class Target {
+         << interface >>
+        + method()
+    }
 
-@enduml
-{% endplantuml %}
+    class Adapter {
+        -Adaptee adaptee
+        + method()
+    }
+
+    class Adaptee {
+         << interface >>
+        + otherMethod()
+    }
+
+    Adapter ..|> Target
+    Adapter --* Adaptee
+    Client --> Target
+    Adapter --> Adaptee : calls otherMethod()
+
+```
 
 - **Client** - class that uses the `Target` object
 - **Target** - interface required by the `Client` class
