--- a/content/posts/2021-08-22-kotlin-command-pattern.md
+++ b/content/posts/2021-08-22-kotlin-command-pattern.md
@@ -28,76 +31,66 @@ The request object, in addition to the standard `execute()` method, may contain 
 - **ConcreteCommand** - specific command. It has all the other objects needed to complete the task.
 
-{% plantuml %}
-@startuml
-hide Client members
-  skinparam linetype ortho
+```mermaid
+classDiagram
+    class Command {
+         << interface >>
+        +execute()
+    }
 
-interface Command{
-    + execute()
-}
+    class ConcreteCommand {
+        -receiver: Receiver
+        -params
+        +execute()
+    }
 
-class ConcreteCommand implements Command{
-    - receiver: Receiver
-    - params
-+ execute()
-}
+    class Receiver {
+        +action()
+    }
 
-class Receiver{
-    + action()
-}
+    class Client
+    class Invoker {
+        -command: Command
+        +setCommand(command)
+        +executeCommand()
+    }
 
-class Client
-class Invoker{
-- command: Command
-+ setCommand(command)
-+ executeCommand()
-}
+    Invoker --> Command
+    Client --> Receiver
+    ConcreteCommand --> Receiver:action()
 
-Invoker *-->Command
-Client --> Receiver
-ConcreteCommand::execute --> Receiver::action
-note "creates command instance\npassing the Receiver\nand command parameters" as N1
-Client .. N1
-N1 ..> ConcreteCommand
+    note for Invoker "calls command when it's needed"
 
-note "sets command instance" as N2
-Client .. N2
-N2 ..> Invoker
+    Client .. ConcreteCommand: creates command instance\npassing the Receiver\nand command parameters
+    Client .. Invoker: sets command instance
 
-note right of Invoker::executeCommand
-    calls command
-    when its needed
-end note
-
-note right of ConcreteCommand::execute
-    calls Receiver action
-end note
-@enduml
-{% endplantuml %}
+```
 
 The order of interactions looks like this:
 
-{% plantuml %}
-@startuml
+```mermaid
+sequenceDiagram
+    participant aClient
+    participant aReceiver
+    participant aCommand
+    participant aInvoker
 
-participant aReceiver
-aClient --> aReceiver : has a
-aClient --> aCommand: Command(aReceiver)
-activate aClient
-aClient -> aInvoker : setCommand(aCommand)
-deactivate aClient
-aInvoker -> aCommand : execute()
-aCommand -> aReceiver : action()
-
-@enduml
-{% endplantuml %}
+    aClient -->> aReceiver : has a
+    aClient -->> aCommand : Command(aReceiver)
+    activate aClient
+    aClient ->> aInvoker : setCommand(aCommand)
+    deactivate aClient
+    aInvoker ->> aCommand : execute()
+    aCommand ->> aReceiver : action()
+```
 
 1. The `Client` creates the instance of the specific `Command`, passing the receiver `Receiver`.
 2. `Invoker` gets a specific instance of the command.
